app/controllers/books_controller.rb

  def index
    @books = Book.search(params[:search_term])
---
SELECT "books".* FROM "books" WHERE (title LIKE '%["lord"]%')

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "description", "mark", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 20 Nov 2012 08:54:41 UTC +00:00], ["description", "Huge description"], ["mark", 5], ["title", "The lord of the rings"], ["updated_at", Tue, 20 Nov 2012 08:54:41 UTC +00:00]]

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "books" SET "mark" = 4, "updated_at" = '2012-11-20 12:59:23.858240' WHERE "books"."id" = 12